КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/AccumulationRegisters/СвободныеОстатки/СвободныеОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d2b56f80-9fb3-4256-ac70-94db57b20403">
  <name>СвободныеОстатки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="13baab32-7323-4955-9670-6e6d591ac27e">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="190d8b4e-655e-4cda-9e59-ed474013adb4">
    <name>ВРезервеСоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fdb0591b-9229-4e19-a90c-ec26852f3f57">
    <name>ВРезервеПодЗаказ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="61bd9a07-a5cf-44a6-8782-269a97817edc">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Enums/ВариантыРасчетаЦенНаборов/ВариантыРасчетаЦенНаборов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="a9f357e7-d8a1-41d9-8e8c-998aba7763d9">
  <name>ВариантыРасчетаЦенНаборов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="95ffa208-4f6c-4263-a3c2-f5da92f7a1cd">
    <name>РассчитываетсяИзЦенКомплектующих</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3397ef23-61b6-4d41-9c81-5d406f66703f">
    <name>ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="299a1f71-e30b-4908-8487-03a62b1c6d26">
    <name>ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Catalogs/ВариантыКомплектацииНоменклатуры/ВариантыКомплектацииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1ce49200-30ea-44d6-97f7-390bc2c5dee9">
  <name>ВариантыКомплектацииНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Номенклатура</owners>
  <tabularSections extendedConfigurationObject="354a86ec-cf4f-4299-a60e-80a77f619e67">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="6219b3de-db0c-4d3e-b4f2-58419c6950a0">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5f89eb00-a169-4f6d-b578-df09d9d8a64e">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6f089d29-db58-4577-966e-b19048e606cd">
      <name>ДоляСтоимости</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fc59acc3-f1f7-4e3f-96da-e580f2c5a88f">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="1b521724-19bd-43e6-b544-b67dc4ba22b9">
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3d295926-ac21-4f62-b76e-64c929f1fc0e">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="722c3d13-753d-4b4f-82b9-d41340f96d79">
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="13dd1676-d9c6-415f-a4e1-cb9414a09577">
    <name>ЕдиницаИзмеренияТНВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/CommonModules/НаборыВызовСервера/Module.bsl
&Вместо("Комплектующие")
Функция ОД_Комплектующие(Параметры, ДополнительныеПараметры)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(Параметры.ВариантКомплектацииНоменклатуры) Тогда
		ВариантКомплектацииНоменклатуры = ВариантКомплектацииНоменклатурыПоУмолчанию(
			Параметры.НоменклатураНабора,
			Параметры.ХарактеристикаНабора);
	Иначе
		ВариантКомплектацииНоменклатуры = Параметры.ВариантКомплектацииНоменклатуры;
	КонецЕсли;
	
	Если Не Параметры.Свойство("КоличествоУпаковок") Тогда
		Параметры.Вставить("КоличествоУпаковок", 1);
	КонецЕсли;
	
	ПодобранныеТовары = Новый Массив;
	
	Если Не ЗначениеЗаполнено(ВариантКомплектацииНоменклатуры) Тогда
		ТекстОшибки = НСтр("ru = 'Для номенклатуры %1 не определен состав набора'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстОшибки,
			Параметры.НоменклатураНабора,
			Параметры.ХарактеристикаНабора);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат ПодобранныеТовары;
	КонецЕсли;
	
	Комплектующие = НаборыСервер.СоздатьТаблицуСоставаНабора(КолонкиНабора());
	Комплектующие.Колонки.Добавить("ТипНоменклатуры", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыНоменклатуры"));
	Комплектующие.Колонки.Добавить("ВидНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ВидыНоменклатуры"));
	Комплектующие.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	
	ВариантРасчетаЦеныНабора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВариантКомплектацииНоменклатуры, "ВариантРасчетаЦеныНабора");
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Т.Номенклатура КАК Номенклатура,
		|	Т.Характеристика КАК Характеристика,
		|	СУММА(Т.Количество) КАК Количество
		|ПОМЕСТИТЬ ОстаткиИзЗаказов
		|ИЗ
		|	РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК Т
		|ГДЕ
		|	Т.ДатаДоступности = ДАТАВРЕМЯ(1, 1, 1)
		|	И Т.Количество < 0
		|	И &ФильтрСкладыТ
		|СГРУППИРОВАТЬ ПО
		|	Т.Номенклатура,
		|	Т.Характеристика
		|////////////////////////////////////////////////////////////////////////////////////
		|
		|;
		|ВЫБРАТЬ
		|	ВариантыКомплектацииНоменклатурыТовары.НомерСтроки КАК НомерСтроки,
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
		|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
		|	ВариантыКомплектацииНоменклатурыТовары.Упаковка КАК Упаковка,
		|	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВариантыКомплектацииНоменклатурыТовары.Количество КАК Количество,
		|	ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости КАК ДоляСтоимости
		|ПОМЕСТИТЬ
		|	ВариантыКомплектацииНоменклатурыТовары
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|ГДЕ
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка = &Ссылка
		|;
		|ВЫБРАТЬ
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
		|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
		|	СУММА(ЕСТЬNULL(СвободныеОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(СвободныеОстатки.ВРезервеПодЗаказОстаток, 0) -
		|	ЕСТЬNULL(СвободныеОстатки.ВРезервеСоСкладаОстаток, 0) + ЕСТЬNULL(ОстаткиИзЗаказов.Количество, 0)) КАК Доступно,
		|	СУММА(ЕСТЬNULL(СвободныеОстатки.ВНаличииОстаток, 0)) КАК ВНаличии
		|ПОМЕСТИТЬ
		|	ДоступностьТоваров
		|ИЗ
		|	ВариантыКомплектацииНоменклатурыТовары КАК ВариантыКомплектацииНоменклатурыТовары
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрНакопления.СвободныеОстатки.Остатки(
		|			,
		|			(Номенклатура,Характеристика) В
		|				(ВЫБРАТЬ
		|					ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
		|					ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика
		|				ИЗ
		|					ВариантыКомплектацииНоменклатурыТовары КАК ВариантыКомплектацииНоменклатурыТовары)
		|			И &ФильтрСклады
		|		) КАК СвободныеОстатки
		|	ПО СвободныеОстатки.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Номенклатура
		|		И СвободныеОстатки.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Характеристика
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		ОстаткиИзЗаказов КАК ОстаткиИзЗаказов
		|		ПО ОстаткиИзЗаказов.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Номенклатура
		|		 И ОстаткиИзЗаказов.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Характеристика
		|СГРУППИРОВАТЬ ПО
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
		|	ВариантыКомплектацииНоменклатурыТовары.Характеристика
		|;
		|ВЫБРАТЬ
		|	ВариантыКомплектацииНоменклатурыТовары.НомерСтроки КАК НомерСтроки,
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
		|	ВариантыКомплектацииНоменклатурыТовары.Упаковка КАК Упаковка,
		|	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВариантыКомплектацииНоменклатурыТовары.Количество КАК Количество,
		|	ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости КАК ДоляСтоимости,
		|	ДоступностьТоваров.Доступно / ЕстьNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК Доступно,
		|	ДоступностьТоваров.ВНаличии / ЕстьNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК ВНаличии
		|ИЗ
		|	ВариантыКомплектацииНоменклатурыТовары КАК ВариантыКомплектацииНоменклатурыТовары
		|ЛЕВОЕ СОЕДИНЕНИЕ ДоступностьТоваров КАК ДоступностьТоваров
		|	ПО ДоступностьТоваров.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Номенклатура
		|	И ДоступностьТоваров.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Характеристика
		|");
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&ТекстЗапросаКоэффициентУпаковки",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"ВЫРАЗИТЬ(ВариантыКомплектацииНоменклатурыТовары.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения)",
		"ВЫРАЗИТЬ(ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Справочник.Номенклатура)"));
		
	Запрос.УстановитьПараметр("Ссылка",  ВариантКомплектацииНоменклатуры);
	
	Если ДополнительныеПараметры.Свойство("Склады") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФильтрСкладыТ", "Т.Склад В(&Склады)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФильтрСклады",  "Склад В (&Склады)");
		Запрос.УстановитьПараметр("Склады",  ДополнительныеПараметры.Склады);
	Иначе
		Запрос.УстановитьПараметр("ФильтрСклады",  Истина);
		Запрос.УстановитьПараметр("ФильтрСкладыТ", Истина);
	КонецЕсли;
		
	Выборка = Запрос.ВыполнитьПакет()[3].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Комплектующие.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.КоличествоУпаковок   = НоваяСтрока.КоличествоУпаковок;
		НоваяСтрока.Количество           = НоваяСтрока.Количество;
		НоваяСтрока.НоменклатураНабора   = Параметры.НоменклатураНабора;
		НоваяСтрока.ХарактеристикаНабора = Параметры.ХарактеристикаНабора;
		
	КонецЦикла;
	
	Если ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих Тогда
		
		Если ДополнительныеПараметры.Свойство("ВидЦены") Тогда
			
			ПараметрыЗаполнения = Новый Структура;
			ПараметрыЗаполнения.Вставить("Дата", ДополнительныеПараметры.Дата);
			ПараметрыЗаполнения.Вставить("Валюта", ДополнительныеПараметры.Валюта);
			ПараметрыЗаполнения.Вставить("ВидЦены", ДополнительныеПараметры.ВидЦены);
			ПараметрыЗаполнения.Вставить("РассчитыватьНаборы", Истина);
			ПараметрыЗаполнения.Вставить("ПоляЗаполнения", "Цена, ВидЦены");
			
			ЦеныРассчитаны = ПродажиСервер.ЗаполнитьЦены(
				Комплектующие,
				Неопределено, // Массив строк или структура отбора.
				ПараметрыЗаполнения);
		ИначеЕсли ДополнительныеПараметры.Свойство("Соглашение") Тогда
			
			ПараметрыЗаполнения = Новый Структура;
			ПараметрыЗаполнения.Вставить("Дата", ДополнительныеПараметры.Дата);
			ПараметрыЗаполнения.Вставить("Валюта", ДополнительныеПараметры.Валюта);
			ПараметрыЗаполнения.Вставить("Соглашение", ДополнительныеПараметры.Соглашение);
			ПараметрыЗаполнения.Вставить("РассчитыватьНаборы", Истина);
			ПараметрыЗаполнения.Вставить("ПоляЗаполнения", "Цена, ВидЦены");
			
			ЦеныРассчитаны = ПродажиСервер.ЗаполнитьЦены(
				Комплектующие,
				Неопределено, // Массив строк или структура отбора.
				ПараметрыЗаполнения);
		КонецЕсли;
		
		Для Каждого СтрокаТЧ Из Комплектующие Цикл
			
			ПараметрыТовара = ПодборТоваровКлиентСервер.ПараметрыТовара();
			ЗаполнитьЗначенияСвойств(ПараметрыТовара, Параметры);
			
			ПараметрыТовара.Номенклатура       = СтрокаТЧ.Номенклатура;
			ПараметрыТовара.Характеристика     = СтрокаТЧ.Характеристика;
			ПараметрыТовара.Упаковка           = СтрокаТЧ.Упаковка;
			ПараметрыТовара.ТипНоменклатуры    = СтрокаТЧ.ТипНоменклатуры;
			ПараметрыТовара.ВидНоменклатуры    = СтрокаТЧ.ВидНоменклатуры;
			ПараметрыТовара.ЕдиницаИзмерения    = СтрокаТЧ.ЕдиницаИзмерения;
			ПараметрыТовара.ВидЦены            = СтрокаТЧ.ВидЦены;
			ПараметрыТовара.Цена               = СтрокаТЧ.Цена;
			ПараметрыТовара.КоличествоУпаковок = СтрокаТЧ.КоличествоУпаковок * Параметры.КоличествоУпаковок;
			ПараметрыТовара.Количество         = СтрокаТЧ.Количество * Параметры.КоличествоУпаковок;
			ПараметрыТовара.Доступно           = СтрокаТЧ.Доступно;
			ПараметрыТовара.ВНаличии           = СтрокаТЧ.ВНаличии;
			
			Если ПараметрыТовара.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга
				ИЛИ ПараметрыТовара.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа Тогда
				ПараметрыТовара.Склад = Неопределено;
			КонецЕсли;
			
			ПараметрыТовара.ХарактеристикиИспользуются = ?(ЗначениеЗаполнено(ПараметрыТовара.Характеристика), Истина, Ложь);
			
			ПодобранныеТовары.Добавить(ПараметрыТовара);
			
		КонецЦикла;
		
	Иначе
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами")
			И ДополнительныеПараметры.Свойство("Соглашение")
			И ЗначениеЗаполнено(ДополнительныеПараметры.Соглашение) Тогда
			
			ПараметрыРасчета = Новый Структура;
			ПараметрыРасчета.Вставить("Дата", ДополнительныеПараметры.Дата);
			ПараметрыРасчета.Вставить("Валюта", ДополнительныеПараметры.Валюта);
			ПараметрыРасчета.Вставить("Соглашение", ДополнительныеПараметры.Соглашение);
			ПараметрыРасчета.Вставить("ПоляЗаполнения", "Цена");
			
		Иначе
			
			ПараметрыРасчета = Новый Структура;
			ПараметрыРасчета.Вставить("Дата", ДополнительныеПараметры.Дата);
			ПараметрыРасчета.Вставить("Валюта", ДополнительныеПараметры.Валюта);
			ПараметрыРасчета.Вставить("ВидЦены", ДополнительныеПараметры.ВидЦены);
			ПараметрыРасчета.Вставить("ПоляЗаполнения", "Цена");
			
		КонецЕсли;
		
		КоэффициентыПропорциональностиРасчетаЦенНаборов = НаборыСервер.КоэффициентыРаспределения(
			Комплектующие.Скопировать(), ПараметрыРасчета);
		
		ОбщаяСтоимость = 0;
		Для Каждого ТекущаяСтрока Из КоэффициентыПропорциональностиРасчетаЦенНаборов Цикл
			ОбщаяСтоимость = ОбщаяСтоимость + ТекущаяСтрока.Цена;
		КонецЦикла;

		СуммаКРаспределению = ДополнительныеПараметры.Цена * Параметры.КоличествоУпаковок;
		
		СлужебнаяТЧ = Новый ТаблицаЗначений;
		СлужебнаяТЧ.Колонки.Добавить("СтрокаТЧ");
		СлужебнаяТЧ.Колонки.Добавить("НомерСтроки");
		
		Комплектующие.Сортировать("КоличествоУпаковок Убыв");
		Для Каждого ТекущаяСтрока Из Комплектующие Цикл
			
			Стоимость = КоэффициентыПропорциональностиРасчетаЦенНаборов.Найти(ТекущаяСтрока.НомерСтроки, "НомерСтроки").Цена;
			
			ПараметрыТовара = ПодборТоваровКлиентСервер.ПараметрыТовара();
			ЗаполнитьЗначенияСвойств(ПараметрыТовара, Параметры);
			
			ПараметрыТовара.Номенклатура       = ТекущаяСтрока.Номенклатура;
			ПараметрыТовара.Характеристика     = ТекущаяСтрока.Характеристика;
			ПараметрыТовара.Упаковка           = ТекущаяСтрока.Упаковка;
			ПараметрыТовара.ТипНоменклатуры    = ТекущаяСтрока.ТипНоменклатуры;
			ПараметрыТовара.ВидНоменклатуры    = ТекущаяСтрока.ВидНоменклатуры;
			ПараметрыТовара.ЕдиницаИзмерения   = ТекущаяСтрока.ЕдиницаИзмерения;
			ПараметрыТовара.КоличествоУпаковок = ТекущаяСтрока.КоличествоУпаковок * Параметры.КоличествоУпаковок;
			ПараметрыТовара.Количество         = ТекущаяСтрока.Количество * Параметры.КоличествоУпаковок;
			
			Если ПараметрыТовара.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга
				ИЛИ ПараметрыТовара.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа Тогда
				ПараметрыТовара.Склад = Неопределено;
			КонецЕсли;
			
			Если ДополнительныеПараметры.Свойство("ВидЦены") Тогда
				ПараметрыТовара.ВидЦены = ДополнительныеПараметры.ВидЦены;
			Иначе
				ПараметрыТовара.ВидЦены = Справочники.ВидыЦен.ПустаяСсылка();
			КонецЕсли;
			
			Если ПараметрыТовара.КоличествоУпаковок <> 0 И ОбщаяСтоимость <> 0 Тогда
				ПараметрыТовара.Цена = Окр(((Стоимость / ОбщаяСтоимость) * СуммаКРаспределению) / ПараметрыТовара.КоличествоУпаковок, 2);
			Иначе
				ПараметрыТовара.Цена = 0;
			КонецЕсли;
			
			ОбщаяСтоимость = ОбщаяСтоимость - Стоимость;
			СуммаКРаспределению = СуммаКРаспределению - ПараметрыТовара.Цена * ПараметрыТовара.КоличествоУпаковок;
			
			ПараметрыТовара.Доступно = ТекущаяСтрока.Доступно;
			ПараметрыТовара.ВНаличии = ТекущаяСтрока.ВНаличии;
			
			ПараметрыТовара.ХарактеристикиИспользуются = ?(ЗначениеЗаполнено(ПараметрыТовара.Характеристика), Истина, Ложь);
			
			СлужебнаяСтрока = СлужебнаяТЧ.Добавить();
			СлужебнаяСтрока.СтрокаТЧ = ПараметрыТовара;
			СлужебнаяСтрока.НомерСтроки = ТекущаяСтрока.НомерСтроки;
			
		КонецЦикла;
		
		Если СуммаКРаспределению <> 0 И СлужебнаяТЧ.Количество() > 0 Тогда
			
			ПоследняяСтрока = СлужебнаяТЧ[СлужебнаяТЧ.Количество() - 1];
			ИсходнаяСтрока = ПоследняяСтрока.СтрокаТЧ;
			
			Если ИсходнаяСтрока.КоличествоУпаковок > 1 Тогда
				НоваяСтрока = ПодборТоваровКлиентСервер.ПараметрыТовара();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ИсходнаяСтрока);
				
				ИсходнаяСтрока.КоличествоУпаковок = ИсходнаяСтрока.КоличествоУпаковок - 1;
				НоваяСтрока.КоличествоУпаковок = 1;
				НоваяСтрока.Цена = НоваяСтрока.Цена + СуммаКРаспределению;
				
				СлужебнаяСтрока = СлужебнаяТЧ.Добавить();
				СлужебнаяСтрока.СтрокаТЧ = НоваяСтрока;
				СлужебнаяСтрока.НомерСтроки = ПоследняяСтрока.НомерСтроки;
				
			Иначе
				
				ИсходнаяСтрока.Погрешность = СуммаКРаспределению;
				
			КонецЕсли;
			
		КонецЕсли;
		
		СлужебнаяТЧ.Сортировать("НомерСтроки Возр");
		Для Каждого СтрокаТЧ Из СлужебнаяТЧ Цикл
			ПодобранныеТовары.Добавить(СтрокаТЧ.СтрокаТЧ);
		КонецЦикла;
		
	КонецЕсли;
	
	// 18.03.2026, Т-5, информационное сообщение, доработки не требуются
	Сообщить("Т-5, ОМ НаборыВызовСервера, расчет цены набора, вызов из подбора");

	Возврат ПодобранныеТовары;
	
КонецФункции
